sysbench/yusp/point_select/single_select.log
sysbench 1.0.9 (using system LuaJIT 2.0.4)

Running the test with following options:
Number of threads: 512
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

DEBUG: Worker thread (#0) started
DEBUG: Worker thread (#1) started
DEBUG: Worker thread (#2) started
DEBUG: Worker thread (#4) started
DEBUG: Worker thread (#3) started
DEBUG: Worker thread (#5) started
DEBUG: Worker thread (#6) started
DEBUG: Worker thread (#7) started
DEBUG: Worker thread (#8) started
DEBUG: Worker thread (#9) started
DEBUG: Worker thread (#10) started
DEBUG: Worker thread (#11) started
DEBUG: Worker thread (#12) started
DEBUG: Worker thread (#13) started
DEBUG: Worker thread (#14) started
DEBUG: Worker thread (#15) started
DEBUG: Worker thread (#16) started
DEBUG: Worker thread (#17) started
DEBUG: Worker thread (#18) started
DEBUG: Worker thread (#19) started
DEBUG: Worker thread (#20) started
DEBUG: Worker thread (#21) started
DEBUG: Worker thread (#23) started
DEBUG: Worker thread (#24) started
DEBUG: Worker thread (#22) started
DEBUG: Worker thread (#26) started
DEBUG: Worker thread (#25) started
DEBUG: Worker thread (#27) started
DEBUG: Worker thread (#28) started
DEBUG: Worker thread (#30) started
DEBUG: Worker thread (#31) started
DEBUG: Worker thread (#32) started
DEBUG: Worker thread (#29) started
DEBUG: Worker thread (#33) started
DEBUG: Worker thread (#34) started
DEBUG: Worker thread (#35) started
DEBUG: Worker thread (#36) started
DEBUG: Worker thread (#37) started
DEBUG: Worker thread (#38) started
DEBUG: Worker thread (#39) started
DEBUG: Worker thread (#40) started
DEBUG: Worker thread (#41) started
DEBUG: Worker thread (#42) started
DEBUG: Worker thread (#43) started
DEBUG: Worker thread (#44) started
DEBUG: Worker thread (#45) started
DEBUG: Worker thread (#46) started
DEBUG: Worker thread (#47) started
DEBUG: Worker thread (#48) started
DEBUG: Worker thread (#49) started
DEBUG: Worker thread (#50) started
DEBUG: Worker thread (#51) started
DEBUG: Worker thread (#52) started
DEBUG: Worker thread (#53) started
DEBUG: Worker thread (#54) started
DEBUG: Worker thread (#55) started
DEBUG: Worker thread (#57) started
DEBUG: Worker thread (#58) started
DEBUG: Worker thread (#60) started
DEBUG: Worker thread (#61) started
DEBUG: Worker thread (#59) started
DEBUG: Worker thread (#56) started
DEBUG: Worker thread (#62) started
DEBUG: Worker thread (#63) started
DEBUG: Worker thread (#64) started
DEBUG: Worker thread (#65) started
DEBUG: Worker thread (#66) started
DEBUG: Worker thread (#67) started
DEBUG: Worker thread (#68) started
DEBUG: Worker thread (#70) started
DEBUG: Worker thread (#69) started
DEBUG: Worker thread (#71) started
DEBUG: Worker thread (#72) started
DEBUG: Worker thread (#73) started
DEBUG: Worker thread (#74) started
DEBUG: Worker thread (#75) started
DEBUG: Reporting thread started
DEBUG: Worker thread (#76) started
DEBUG: Worker thread (#77) started
DEBUG: Worker thread (#78) started
DEBUG: Worker thread (#79) started
DEBUG: Worker thread (#80) started
DEBUG: Worker thread (#81) started
DEBUG: Worker thread (#82) started
DEBUG: Worker thread (#83) started
DEBUG: Worker thread (#84) started
DEBUG: Worker thread (#85) started
DEBUG: Worker thread (#86) started
DEBUG: Worker thread (#87) started
DEBUG: Worker thread (#88) started
DEBUG: Worker thread (#89) started
DEBUG: Worker thread (#90) started
DEBUG: Worker thread (#91) started
DEBUG: Worker thread (#92) started
DEBUG: Worker thread (#93) started
DEBUG: Worker thread (#94) started
DEBUG: Worker thread (#95) started
DEBUG: Worker thread (#96) started
DEBUG: Worker thread (#97) started
DEBUG: Worker thread (#98) started
DEBUG: Worker thread (#100) started
DEBUG: Worker thread (#101) started
DEBUG: Worker thread (#99) started
DEBUG: Worker thread (#104) started
DEBUG: Worker thread (#103) started
DEBUG: Worker thread (#102) started
DEBUG: Worker thread (#105) started
DEBUG: Worker thread (#107) started
DEBUG: Worker thread (#106) started
DEBUG: Worker thread (#108) started
DEBUG: Worker thread (#109) started
DEBUG: Worker thread (#110) started
DEBUG: Worker thread (#111) started
DEBUG: Worker thread (#112) started
DEBUG: Worker thread (#113) started
DEBUG: Worker thread (#114) started
DEBUG: Worker thread (#115) started
DEBUG: Worker thread (#116) started
DEBUG: Worker thread (#117) started
DEBUG: Worker thread (#118) started
DEBUG: Worker thread (#119) started
DEBUG: Worker thread (#120) started
DEBUG: Worker thread (#121) started
DEBUG: Worker thread (#122) started
DEBUG: Worker thread (#123) started
DEBUG: Worker thread (#124) started
DEBUG: Worker thread (#125) started
DEBUG: Worker thread (#126) started
DEBUG: Worker thread (#127) started
DEBUG: Worker thread (#128) started
DEBUG: Worker thread (#129) started
DEBUG: Worker thread (#131) started
DEBUG: Worker thread (#130) started
DEBUG: Worker thread (#132) started
DEBUG: Worker thread (#133) started
DEBUG: Worker thread (#134) started
DEBUG: Worker thread (#135) started
DEBUG: Worker thread (#136) started
DEBUG: Worker thread (#137) started
DEBUG: Worker thread (#138) started
DEBUG: Worker thread (#139) started
DEBUG: Worker thread (#140) started
DEBUG: Worker thread (#141) started
DEBUG: Worker thread (#142) started
DEBUG: Worker thread (#143) started
DEBUG: Worker thread (#144) started
DEBUG: Worker thread (#145) started
DEBUG: Worker thread (#146) started
DEBUG: Worker thread (#147) started
DEBUG: Worker thread (#148) started
DEBUG: Worker thread (#149) started
DEBUG: Worker thread (#150) started
DEBUG: Worker thread (#151) started
DEBUG: Worker thread (#152) started
DEBUG: Worker thread (#153) started
DEBUG: Worker thread (#154) started
DEBUG: Worker thread (#155) started
DEBUG: Worker thread (#156) started
DEBUG: Worker thread (#157) started
DEBUG: Worker thread (#158) started
DEBUG: Worker thread (#159) started
DEBUG: Worker thread (#160) started
DEBUG: Worker thread (#161) started
DEBUG: Worker thread (#162) started
DEBUG: Worker thread (#163) started
DEBUG: Worker thread (#164) started
DEBUG: Worker thread (#165) started
DEBUG: Worker thread (#166) started
DEBUG: Worker thread (#167) started
DEBUG: Worker thread (#168) started
DEBUG: Worker thread (#169) started
DEBUG: Worker thread (#170) started
DEBUG: Worker thread (#171) started
DEBUG: Worker thread (#172) started
DEBUG: Worker thread (#173) started
DEBUG: Worker thread (#174) started
DEBUG: Worker thread (#175) started
DEBUG: Worker thread (#176) started
DEBUG: Worker thread (#177) started
DEBUG: Worker thread (#178) started
DEBUG: Worker thread (#179) started
DEBUG: Worker thread (#180) started
DEBUG: Worker thread (#181) started
DEBUG: Worker thread (#182) started
DEBUG: Worker thread (#183) started
DEBUG: Worker thread (#184) started
DEBUG: Worker thread (#185) started
DEBUG: Worker thread (#186) started
DEBUG: Worker thread (#187) started
DEBUG: Worker thread (#188) started
DEBUG: Worker thread (#189) started
DEBUG: Worker thread (#190) started
DEBUG: Worker thread (#191) started
DEBUG: Worker thread (#192) started
DEBUG: Worker thread (#193) started
DEBUG: Worker thread (#194) started
DEBUG: Worker thread (#195) started
DEBUG: Worker thread (#196) started
DEBUG: Worker thread (#197) started
DEBUG: Worker thread (#198) started
DEBUG: Worker thread (#199) started
DEBUG: Worker thread (#200) started
DEBUG: Worker thread (#201) started
DEBUG: Worker thread (#202) started
DEBUG: Worker thread (#203) started
DEBUG: Worker thread (#204) started
DEBUG: Worker thread (#205) started
DEBUG: Worker thread (#206) started
DEBUG: Worker thread (#207) started
DEBUG: Worker thread (#208) started
DEBUG: Worker thread (#209) started
DEBUG: Worker thread (#210) started
DEBUG: Worker thread (#211) started
DEBUG: Worker thread (#212) started
DEBUG: Worker thread (#213) started
DEBUG: Worker thread (#214) started
DEBUG: Worker thread (#215) started
DEBUG: Worker thread (#216) started
DEBUG: Worker thread (#217) started
DEBUG: Worker thread (#218) started
DEBUG: Worker thread (#219) started
DEBUG: Worker thread (#220) started
DEBUG: Worker thread (#221) started
DEBUG: Worker thread (#222) started
DEBUG: Worker thread (#223) started
DEBUG: Worker thread (#224) started
DEBUG: Worker thread (#225) started
DEBUG: Worker thread (#226) started
DEBUG: Worker thread (#227) started
DEBUG: Worker thread (#228) started
DEBUG: Worker thread (#229) started
DEBUG: Worker thread (#230) started
DEBUG: Worker thread (#231) started
DEBUG: Worker thread (#232) started
DEBUG: Worker thread (#233) started
DEBUG: Worker thread (#234) started
DEBUG: Worker thread (#235) started
DEBUG: Worker thread (#236) started
DEBUG: Worker thread (#237) started
DEBUG: Worker thread (#238) started
DEBUG: Worker thread (#239) started
DEBUG: Worker thread (#240) started
DEBUG: Worker thread (#241) started
DEBUG: Worker thread (#242) started
DEBUG: Worker thread (#243) started
DEBUG: Worker thread (#244) started
DEBUG: Worker thread (#245) started
DEBUG: Worker thread (#246) started
DEBUG: Worker thread (#247) started
DEBUG: Worker thread (#248) started
DEBUG: Worker thread (#249) started
DEBUG: Worker thread (#250) started
DEBUG: Worker thread (#251) started
DEBUG: Worker thread (#252) started
DEBUG: Worker thread (#253) started
DEBUG: Worker thread (#254) started
DEBUG: Worker thread (#255) started
DEBUG: Worker thread (#256) started
DEBUG: Worker thread (#257) started
DEBUG: Worker thread (#258) started
DEBUG: Worker thread (#259) started
DEBUG: Worker thread (#260) started
DEBUG: Worker thread (#261) started
DEBUG: Worker thread (#262) started
DEBUG: Worker thread (#263) started
DEBUG: Worker thread (#264) started
DEBUG: Worker thread (#265) started
DEBUG: Worker thread (#266) started
DEBUG: Worker thread (#267) started
DEBUG: Worker thread (#268) started
DEBUG: Worker thread (#269) started
DEBUG: Worker thread (#270) started
DEBUG: Worker thread (#271) started
DEBUG: Worker thread (#272) started
DEBUG: Worker thread (#273) started
DEBUG: Worker thread (#274) started
DEBUG: Worker thread (#275) started
DEBUG: Worker thread (#276) started
DEBUG: Worker thread (#277) started
DEBUG: Worker thread (#278) started
DEBUG: Worker thread (#279) started
DEBUG: Worker thread (#280) started
DEBUG: Worker thread (#281) started
DEBUG: Worker thread (#282) started
DEBUG: Worker thread (#283) started
DEBUG: Worker thread (#284) started
DEBUG: Worker thread (#285) started
DEBUG: Worker thread (#286) started
DEBUG: Worker thread (#287) started
DEBUG: Worker thread (#288) started
DEBUG: Worker thread (#289) started
DEBUG: Worker thread (#290) started
DEBUG: Worker thread (#291) started
DEBUG: Worker thread (#292) started
DEBUG: Worker thread (#293) started
DEBUG: Worker thread (#294) started
DEBUG: Worker thread (#295) started
DEBUG: Worker thread (#296) started
DEBUG: Worker thread (#24) initialized
DEBUG: Worker thread (#297) started
DEBUG: Worker thread (#298) started
DEBUG: Worker thread (#299) started
DEBUG: Worker thread (#300) started
DEBUG: Worker thread (#301) started
DEBUG: Worker thread (#302) started
DEBUG: Worker thread (#303) started
DEBUG: Worker thread (#304) started
DEBUG: Worker thread (#305) started
DEBUG: Worker thread (#306) started
DEBUG: Worker thread (#307) started
DEBUG: Worker thread (#308) started
DEBUG: Worker thread (#309) started
DEBUG: Worker thread (#310) started
DEBUG: Worker thread (#311) started
DEBUG: Worker thread (#312) started
DEBUG: Worker thread (#313) started
DEBUG: Worker thread (#13) initialized
DEBUG: Worker thread (#314) started
DEBUG: Worker thread (#31) initialized
DEBUG: Worker thread (#315) started
DEBUG: Worker thread (#67) initialized
DEBUG: Worker thread (#316) started
DEBUG: Worker thread (#317) started
DEBUG: Worker thread (#318) started
DEBUG: Worker thread (#42) initialized
DEBUG: Worker thread (#319) started
DEBUG: Worker thread (#320) started
DEBUG: Worker thread (#321) started
DEBUG: Worker thread (#322) started
DEBUG: Worker thread (#27) initialized
DEBUG: Worker thread (#18) initialized
DEBUG: Worker thread (#323) started
DEBUG: Worker thread (#324) started
DEBUG: Worker thread (#325) started
DEBUG: Worker thread (#326) started
DEBUG: Worker thread (#327) started
DEBUG: Worker thread (#328) started
DEBUG: Worker thread (#329) started
DEBUG: Worker thread (#330) started
DEBUG: Worker thread (#331) started
DEBUG: Worker thread (#332) started
DEBUG: Worker thread (#333) started
DEBUG: Worker thread (#334) started
DEBUG: Worker thread (#335) started
DEBUG: Worker thread (#336) started
DEBUG: Worker thread (#337) started
DEBUG: Worker thread (#338) started
DEBUG: Worker thread (#339) started
DEBUG: Worker thread (#340) started
DEBUG: Worker thread (#341) started
DEBUG: Worker thread (#342) started
DEBUG: Worker thread (#343) started
DEBUG: Worker thread (#344) started
DEBUG: Worker thread (#345) started
DEBUG: Worker thread (#346) started
DEBUG: Worker thread (#347) started
DEBUG: Worker thread (#348) started
DEBUG: Worker thread (#349) started
DEBUG: Worker thread (#350) started
DEBUG: Worker thread (#351) started
DEBUG: Worker thread (#352) started
DEBUG: Worker thread (#353) started
DEBUG: Worker thread (#354) started
DEBUG: Worker thread (#355) started
DEBUG: Worker thread (#356) started
DEBUG: Worker thread (#357) started
DEBUG: Worker thread (#358) started
DEBUG: Worker thread (#359) started
DEBUG: Worker thread (#360) started
DEBUG: Worker thread (#361) started
DEBUG: Worker thread (#362) started
DEBUG: Worker thread (#16) initialized
DEBUG: Worker thread (#363) started
DEBUG: Worker thread (#364) started
DEBUG: Worker thread (#365) started
DEBUG: Worker thread (#366) started
DEBUG: Worker thread (#367) started
DEBUG: Worker thread (#368) started
DEBUG: Worker thread (#369) started
DEBUG: Worker thread (#370) started
DEBUG: Worker thread (#371) started
DEBUG: Worker thread (#372) started
DEBUG: Worker thread (#373) started
DEBUG: Worker thread (#374) started
DEBUG: Worker thread (#375) started
DEBUG: Worker thread (#376) started
DEBUG: Worker thread (#377) started
DEBUG: Worker thread (#378) started
DEBUG: Worker thread (#379) started
DEBUG: Worker thread (#380) started
DEBUG: Worker thread (#381) started
DEBUG: Worker thread (#382) started
DEBUG: Worker thread (#383) started
DEBUG: Worker thread (#384) started
DEBUG: Worker thread (#385) started
DEBUG: Worker thread (#386) started
DEBUG: Worker thread (#387) started
DEBUG: Worker thread (#388) started
DEBUG: Worker thread (#389) started
DEBUG: Worker thread (#390) started
DEBUG: Worker thread (#391) started
DEBUG: Worker thread (#392) started
DEBUG: Worker thread (#393) started
DEBUG: Worker thread (#394) started
DEBUG: Worker thread (#395) started
DEBUG: Worker thread (#396) started
DEBUG: Worker thread (#397) started
DEBUG: Worker thread (#398) started
DEBUG: Worker thread (#399) started
DEBUG: Worker thread (#400) started
DEBUG: Worker thread (#401) started
DEBUG: Worker thread (#402) started
DEBUG: Worker thread (#403) started
DEBUG: Worker thread (#404) started
DEBUG: Worker thread (#405) started
DEBUG: Worker thread (#406) started
DEBUG: Worker thread (#407) started
DEBUG: Worker thread (#408) started
DEBUG: Worker thread (#409) started
DEBUG: Worker thread (#410) started
DEBUG: Worker thread (#411) started
DEBUG: Worker thread (#412) started
DEBUG: Worker thread (#413) started
DEBUG: Worker thread (#414) started
DEBUG: Worker thread (#415) started
DEBUG: Worker thread (#416) started
DEBUG: Worker thread (#417) started
DEBUG: Worker thread (#418) started
DEBUG: Worker thread (#419) started
DEBUG: Worker thread (#420) started
DEBUG: Worker thread (#421) started
DEBUG: Worker thread (#422) started
DEBUG: Worker thread (#423) started
DEBUG: Worker thread (#424) started
DEBUG: Worker thread (#425) started
DEBUG: Worker thread (#426) started
DEBUG: Worker thread (#427) started
DEBUG: Worker thread (#428) started
DEBUG: Worker thread (#429) started
DEBUG: Worker thread (#430) started
DEBUG: Worker thread (#431) started
DEBUG: Worker thread (#433) started
DEBUG: Worker thread (#432) started
DEBUG: Worker thread (#434) started
DEBUG: Worker thread (#435) started
DEBUG: Worker thread (#436) started
DEBUG: Worker thread (#437) started
DEBUG: Worker thread (#438) started
DEBUG: Worker thread (#439) started
DEBUG: Worker thread (#440) started
DEBUG: Worker thread (#441) started
DEBUG: Worker thread (#442) started
DEBUG: Worker thread (#443) started
DEBUG: Worker thread (#444) started
DEBUG: Worker thread (#445) started
DEBUG: Worker thread (#446) started
DEBUG: Worker thread (#447) started
DEBUG: Worker thread (#448) started
DEBUG: Worker thread (#449) started
DEBUG: Worker thread (#450) started
DEBUG: Worker thread (#451) started
DEBUG: Worker thread (#452) started
DEBUG: Worker thread (#453) started
DEBUG: Worker thread (#70) initialized
DEBUG: Worker thread (#454) started
DEBUG: Worker thread (#455) started
DEBUG: Worker thread (#456) started
DEBUG: Worker thread (#457) started
DEBUG: Worker thread (#458) started
DEBUG: Worker thread (#459) started
DEBUG: Worker thread (#460) started
DEBUG: Worker thread (#461) started
DEBUG: Worker thread (#462) started
DEBUG: Worker thread (#463) started
DEBUG: Worker thread (#464) started
DEBUG: Worker thread (#465) started
DEBUG: Worker thread (#466) started
DEBUG: Worker thread (#467) started
DEBUG: Worker thread (#468) started
DEBUG: Worker thread (#469) started
DEBUG: Worker thread (#470) started
DEBUG: Worker thread (#471) started
DEBUG: Worker thread (#472) started
DEBUG: Worker thread (#473) started
DEBUG: Worker thread (#474) started
DEBUG: Worker thread (#475) started
DEBUG: Worker thread (#476) started
DEBUG: Worker thread (#477) started
DEBUG: Worker thread (#478) started
DEBUG: Worker thread (#479) started
DEBUG: Worker thread (#480) started
DEBUG: Worker thread (#481) started
DEBUG: Worker thread (#482) started
DEBUG: Worker thread (#483) started
DEBUG: Worker thread (#484) started
DEBUG: Worker thread (#485) started
DEBUG: Worker thread (#486) started
DEBUG: Worker thread (#487) started
DEBUG: Worker thread (#65) initialized
DEBUG: Worker thread (#488) started
DEBUG: Worker thread (#489) started
DEBUG: Worker thread (#490) started
DEBUG: Worker thread (#30) initialized
DEBUG: Worker thread (#491) started
DEBUG: Worker thread (#4) initialized
DEBUG: Worker thread (#492) started
DEBUG: Worker thread (#45) initialized
DEBUG: Worker thread (#493) started
DEBUG: Worker thread (#6) initialized
DEBUG: Worker thread (#494) started
DEBUG: Worker thread (#29) initialized
DEBUG: Worker thread (#28) initialized
DEBUG: Worker thread (#133) initialized
DEBUG: Worker thread (#495) started
DEBUG: Worker thread (#496) started
DEBUG: Worker thread (#7) initialized
DEBUG: Worker thread (#73) initialized
DEBUG: Worker thread (#497) started
DEBUG: Worker thread (#498) started
DEBUG: Worker thread (#50) initialized
DEBUG: Worker thread (#26) initialized
DEBUG: Worker thread (#52) initialized
DEBUG: Worker thread (#499) started
DEBUG: Worker thread (#500) started
DEBUG: Worker thread (#501) started
DEBUG: Worker thread (#502) started
DEBUG: Worker thread (#503) started
DEBUG: Worker thread (#504) started
DEBUG: Worker thread (#505) started
DEBUG: Worker thread (#506) started
DEBUG: Worker thread (#507) started
DEBUG: Worker thread (#508) started
DEBUG: Worker thread (#509) started
DEBUG: Worker thread (#510) started
DEBUG: Worker thread (#511) started
DEBUG: Worker thread (#1) initialized
DEBUG: Worker thread (#19) initialized
DEBUG: Worker thread (#36) initialized
DEBUG: Worker thread (#5) initialized
DEBUG: Worker thread (#55) initialized
DEBUG: Worker thread (#10) initialized
DEBUG: Worker thread (#8) initialized
DEBUG: Worker thread (#41) initialized
DEBUG: Worker thread (#82) initialized
DEBUG: Worker thread (#15) initialized
DEBUG: Worker thread (#43) initialized
DEBUG: Worker thread (#23) initialized
DEBUG: Worker thread (#48) initialized
DEBUG: Worker thread (#2) initialized
DEBUG: Worker thread (#25) initialized
DEBUG: Worker thread (#9) initialized
DEBUG: Worker thread (#72) initialized
DEBUG: Worker thread (#14) initialized
DEBUG: Worker thread (#138) initialized
DEBUG: Worker thread (#12) initialized
DEBUG: Worker thread (#22) initialized
DEBUG: Worker thread (#34) initialized
DEBUG: Worker thread (#0) initialized
DEBUG: Worker thread (#21) initialized
DEBUG: Worker thread (#20) initialized
DEBUG: Worker thread (#33) initialized
DEBUG: Worker thread (#39) initialized
DEBUG: Worker thread (#35) initialized
DEBUG: Worker thread (#54) initialized
DEBUG: Worker thread (#40) initialized
DEBUG: Worker thread (#32) initialized
DEBUG: Worker thread (#154) initialized
DEBUG: Worker thread (#111) initialized
DEBUG: Worker thread (#58) initialized
DEBUG: Worker thread (#51) initialized
DEBUG: Worker thread (#64) initialized
DEBUG: Worker thread (#129) initialized
DEBUG: Worker thread (#11) initialized
DEBUG: Worker thread (#17) initialized
DEBUG: Worker thread (#44) initialized
DEBUG: Worker thread (#87) initialized
DEBUG: Worker thread (#95) initialized
DEBUG: Worker thread (#148) initialized
DEBUG: Worker thread (#101) initialized
DEBUG: Worker thread (#184) initialized
DEBUG: Worker thread (#92) initialized
DEBUG: Worker thread (#80) initialized
DEBUG: Worker thread (#49) initialized
DEBUG: Worker thread (#185) initialized
DEBUG: Worker thread (#96) initialized
DEBUG: Worker thread (#166) initialized
DEBUG: Worker thread (#91) initialized
DEBUG: Worker thread (#107) initialized
DEBUG: Worker thread (#104) initialized
DEBUG: Worker thread (#76) initialized
DEBUG: Worker thread (#63) initialized
DEBUG: Worker thread (#88) initialized
DEBUG: Worker thread (#113) initialized
DEBUG: Worker thread (#66) initialized
DEBUG: Worker thread (#103) initialized
DEBUG: Worker thread (#123) initialized
DEBUG: Worker thread (#108) initialized
DEBUG: Worker thread (#68) initialized
DEBUG: Worker thread (#190) initialized
DEBUG: Worker thread (#62) initialized
DEBUG: Worker thread (#130) initialized
DEBUG: Worker thread (#53) initialized
DEBUG: Worker thread (#115) initialized
DEBUG: Worker thread (#78) initialized
DEBUG: Worker thread (#124) initialized
DEBUG: Worker thread (#140) initialized
DEBUG: Worker thread (#98) initialized
DEBUG: Worker thread (#117) initialized
DEBUG: Worker thread (#137) initialized
DEBUG: Worker thread (#59) initialized
DEBUG: Worker thread (#102) initialized
DEBUG: Worker thread (#99) initialized
DEBUG: Worker thread (#46) initialized
DEBUG: Worker thread (#86) initialized
DEBUG: Worker thread (#47) initialized
DEBUG: Worker thread (#75) initialized
DEBUG: Worker thread (#139) initialized
DEBUG: Worker thread (#61) initialized
DEBUG: Worker thread (#60) initialized
DEBUG: Worker thread (#85) initialized
DEBUG: Worker thread (#243) initialized
DEBUG: Worker thread (#105) initialized
DEBUG: Worker thread (#142) initialized
DEBUG: Worker thread (#90) initialized
DEBUG: Worker thread (#94) initialized
DEBUG: Worker thread (#172) initialized
DEBUG: Worker thread (#150) initialized
DEBUG: Worker thread (#37) initialized
DEBUG: Worker thread (#38) initialized
DEBUG: Worker thread (#110) initialized
DEBUG: Worker thread (#77) initialized
DEBUG: Worker thread (#74) initialized
DEBUG: Worker thread (#79) initialized
DEBUG: Worker thread (#100) initialized
DEBUG: Worker thread (#69) initialized
DEBUG: Worker thread (#81) initialized
DEBUG: Worker thread (#178) initialized
DEBUG: Worker thread (#3) initialized
DEBUG: Worker thread (#231) initialized
DEBUG: Worker thread (#135) initialized
DEBUG: Worker thread (#336) initialized
DEBUG: Worker thread (#56) initialized
DEBUG: Worker thread (#332) initialized
DEBUG: Worker thread (#306) initialized
DEBUG: Worker thread (#84) initialized
DEBUG: Worker thread (#208) initialized
DEBUG: Worker thread (#164) initialized
DEBUG: Worker thread (#71) initialized
DEBUG: Worker thread (#221) initialized
DEBUG: Worker thread (#195) initialized
DEBUG: Worker thread (#89) initialized
DEBUG: Worker thread (#106) initialized
DEBUG: Worker thread (#134) initialized
DEBUG: Worker thread (#217) initialized
DEBUG: Worker thread (#83) initialized
DEBUG: Worker thread (#240) initialized
DEBUG: Worker thread (#276) initialized
DEBUG: Worker thread (#250) initialized
DEBUG: Worker thread (#237) initialized
DEBUG: Worker thread (#234) initialized
DEBUG: Worker thread (#348) initialized
DEBUG: Worker thread (#253) initialized
DEBUG: Worker thread (#286) initialized
DEBUG: Worker thread (#257) initialized
DEBUG: Worker thread (#57) initialized
DEBUG: Worker thread (#112) initialized
DEBUG: Worker thread (#152) initialized
DEBUG: Worker thread (#97) initialized
DEBUG: Worker thread (#157) initialized
DEBUG: Worker thread (#163) initialized
DEBUG: Worker thread (#320) initialized
DEBUG: Worker thread (#128) initialized
DEBUG: Worker thread (#127) initialized
DEBUG: Worker thread (#118) initialized
DEBUG: Worker thread (#205) initialized
DEBUG: Worker thread (#189) initialized
DEBUG: Worker thread (#119) initialized
DEBUG: Worker thread (#506) initialized
DEBUG: Worker thread (#93) initialized
DEBUG: Worker thread (#179) initialized
DEBUG: Worker thread (#225) initialized
DEBUG: Worker thread (#196) initialized
DEBUG: Worker thread (#132) initialized
DEBUG: Worker thread (#312) initialized
DEBUG: Worker thread (#419) initialized
DEBUG: Worker thread (#214) initialized
DEBUG: Worker thread (#174) initialized
DEBUG: Worker thread (#227) initialized
DEBUG: Worker thread (#328) initialized
DEBUG: Worker thread (#224) initialized
DEBUG: Worker thread (#144) initialized
DEBUG: Worker thread (#230) initialized
DEBUG: Worker thread (#143) initialized
DEBUG: Worker thread (#308) initialized
DEBUG: Worker thread (#219) initialized
DEBUG: Worker thread (#272) initialized
DEBUG: Worker thread (#420) initialized
DEBUG: Worker thread (#177) initialized
DEBUG: Worker thread (#406) initialized
DEBUG: Worker thread (#285) initialized
DEBUG: Worker thread (#291) initialized
DEBUG: Worker thread (#223) initialized
DEBUG: Worker thread (#203) initialized
DEBUG: Worker thread (#213) initialized
DEBUG: Worker thread (#122) initialized
DEBUG: Worker thread (#238) initialized
DEBUG: Worker thread (#385) initialized
DEBUG: Worker thread (#145) initialized
DEBUG: Worker thread (#162) initialized
DEBUG: Worker thread (#114) initialized
DEBUG: Worker thread (#245) initialized
DEBUG: Worker thread (#416) initialized
DEBUG: Worker thread (#407) initialized
DEBUG: Worker thread (#393) initialized
DEBUG: Worker thread (#202) initialized
DEBUG: Worker thread (#389) initialized
DEBUG: Worker thread (#141) initialized
DEBUG: Worker thread (#199) initialized
DEBUG: Worker thread (#426) initialized
DEBUG: Worker thread (#180) initialized
DEBUG: Worker thread (#323) initialized
DEBUG: Worker thread (#156) initialized
DEBUG: Worker thread (#476) initialized
DEBUG: Worker thread (#266) initialized
DEBUG: Worker thread (#329) initialized
DEBUG: Worker thread (#383) initialized
DEBUG: Worker thread (#264) initialized
DEBUG: Worker thread (#402) initialized
DEBUG: Worker thread (#300) initialized
DEBUG: Worker thread (#422) initialized
DEBUG: Worker thread (#131) initialized
DEBUG: Worker thread (#120) initialized
DEBUG: Worker thread (#136) initialized
DEBUG: Worker thread (#279) initialized
DEBUG: Worker thread (#359) initialized
DEBUG: Worker thread (#492) initialized
DEBUG: Worker thread (#149) initialized
DEBUG: Worker thread (#121) initialized
DEBUG: Worker thread (#169) initialized
DEBUG: Worker thread (#126) initialized
DEBUG: Worker thread (#158) initialized
DEBUG: Worker thread (#116) initialized
DEBUG: Worker thread (#423) initialized
DEBUG: Worker thread (#366) initialized
DEBUG: Worker thread (#175) initialized
DEBUG: Worker thread (#198) initialized
DEBUG: Worker thread (#412) initialized
DEBUG: Worker thread (#459) initialized
DEBUG: Worker thread (#182) initialized
DEBUG: Worker thread (#343) initialized
DEBUG: Worker thread (#367) initialized
DEBUG: Worker thread (#161) initialized
DEBUG: Worker thread (#299) initialized
DEBUG: Worker thread (#211) initialized
DEBUG: Worker thread (#280) initialized
DEBUG: Worker thread (#171) initialized
DEBUG: Worker thread (#372) initialized
DEBUG: Worker thread (#379) initialized
DEBUG: Worker thread (#327) initialized
DEBUG: Worker thread (#271) initialized
DEBUG: Worker thread (#256) initialized
DEBUG: Worker thread (#192) initialized
DEBUG: Worker thread (#125) initialized
DEBUG: Worker thread (#361) initialized
DEBUG: Worker thread (#369) initialized
DEBUG: Worker thread (#281) initialized
DEBUG: Worker thread (#302) initialized
DEBUG: Worker thread (#263) initialized
DEBUG: Worker thread (#222) initialized
DEBUG: Worker thread (#381) initialized
DEBUG: Worker thread (#390) initialized
DEBUG: Worker thread (#173) initialized
DEBUG: Worker thread (#183) initialized
DEBUG: Worker thread (#216) initialized
DEBUG: Worker thread (#165) initialized
DEBUG: Worker thread (#193) initialized
DEBUG: Worker thread (#489) initialized
DEBUG: Worker thread (#371) initialized
DEBUG: Worker thread (#181) initialized
DEBUG: Worker thread (#403) initialized
DEBUG: Worker thread (#168) initialized
DEBUG: Worker thread (#298) initialized
DEBUG: Worker thread (#226) initialized
DEBUG: Worker thread (#405) initialized
DEBUG: Worker thread (#499) initialized
DEBUG: Worker thread (#339) initialized
DEBUG: Worker thread (#292) initialized
DEBUG: Worker thread (#397) initialized
DEBUG: Worker thread (#176) initialized
DEBUG: Worker thread (#204) initialized
DEBUG: Worker thread (#362) initialized
DEBUG: Worker thread (#510) initialized
DEBUG: Worker thread (#391) initialized
DEBUG: Worker thread (#495) initialized
DEBUG: Worker thread (#396) initialized
DEBUG: Worker thread (#167) initialized
DEBUG: Worker thread (#394) initialized
DEBUG: Worker thread (#392) initialized
DEBUG: Worker thread (#461) initialized
DEBUG: Worker thread (#151) initialized
DEBUG: Worker thread (#267) initialized
DEBUG: Worker thread (#187) initialized
DEBUG: Worker thread (#310) initialized
DEBUG: Worker thread (#435) initialized
DEBUG: Worker thread (#246) initialized
DEBUG: Worker thread (#333) initialized
DEBUG: Worker thread (#258) initialized
DEBUG: Worker thread (#365) initialized
DEBUG: Worker thread (#418) initialized
DEBUG: Worker thread (#421) initialized
DEBUG: Worker thread (#498) initialized
DEBUG: Worker thread (#436) initialized
DEBUG: Worker thread (#303) initialized
DEBUG: Worker thread (#500) initialized
DEBUG: Worker thread (#209) initialized
DEBUG: Worker thread (#345) initialized
DEBUG: Worker thread (#410) initialized
DEBUG: Worker thread (#442) initialized
DEBUG: Worker thread (#395) initialized
DEBUG: Worker thread (#382) initialized
DEBUG: Worker thread (#261) initialized
DEBUG: Worker thread (#331) initialized
DEBUG: Worker thread (#146) initialized
DEBUG: Worker thread (#314) initialized
DEBUG: Worker thread (#424) initialized
DEBUG: Worker thread (#260) initialized
DEBUG: Worker thread (#282) initialized
DEBUG: Worker thread (#147) initialized
DEBUG: Worker thread (#460) initialized
DEBUG: Worker thread (#309) initialized
DEBUG: Worker thread (#465) initialized
DEBUG: Worker thread (#194) initialized
DEBUG: Worker thread (#206) initialized
DEBUG: Worker thread (#509) initialized
DEBUG: Worker thread (#293) initialized
DEBUG: Worker thread (#350) initialized
DEBUG: Worker thread (#439) initialized
DEBUG: Worker thread (#255) initialized
DEBUG: Worker thread (#170) initialized
DEBUG: Worker thread (#109) initialized
DEBUG: Worker thread (#437) initialized
DEBUG: Worker thread (#493) initialized
DEBUG: Worker thread (#330) initialized
DEBUG: Worker thread (#443) initialized
DEBUG: Worker thread (#433) initialized
DEBUG: Worker thread (#507) initialized
DEBUG: Worker thread (#269) initialized
DEBUG: Worker thread (#233) initialized
DEBUG: Worker thread (#376) initialized
DEBUG: Worker thread (#414) initialized
DEBUG: Worker thread (#483) initialized
DEBUG: Worker thread (#188) initialized
DEBUG: Worker thread (#236) initialized
DEBUG: Worker thread (#440) initialized
DEBUG: Worker thread (#508) initialized
DEBUG: Worker thread (#477) initialized
DEBUG: Worker thread (#244) initialized
DEBUG: Worker thread (#398) initialized
DEBUG: Worker thread (#321) initialized
DEBUG: Worker thread (#335) initialized
DEBUG: Worker thread (#490) initialized
DEBUG: Worker thread (#197) initialized
DEBUG: Worker thread (#265) initialized
DEBUG: Worker thread (#215) initialized
DEBUG: Worker thread (#301) initialized
DEBUG: Worker thread (#305) initialized
DEBUG: Worker thread (#485) initialized
DEBUG: Worker thread (#380) initialized
DEBUG: Worker thread (#201) initialized
DEBUG: Worker thread (#434) initialized
DEBUG: Worker thread (#451) initialized
DEBUG: Worker thread (#480) initialized
DEBUG: Worker thread (#294) initialized
DEBUG: Worker thread (#278) initialized
DEBUG: Worker thread (#504) initialized
DEBUG: Worker thread (#511) initialized
DEBUG: Worker thread (#373) initialized
DEBUG: Worker thread (#324) initialized
DEBUG: Worker thread (#288) initialized
DEBUG: Worker thread (#159) initialized
DEBUG: Worker thread (#186) initialized
DEBUG: Worker thread (#322) initialized
DEBUG: Worker thread (#474) initialized
DEBUG: Worker thread (#368) initialized
DEBUG: Worker thread (#210) initialized
DEBUG: Worker thread (#153) initialized
DEBUG: Worker thread (#352) initialized
DEBUG: Worker thread (#428) initialized
DEBUG: Worker thread (#466) initialized
DEBUG: Worker thread (#478) initialized
DEBUG: Worker thread (#290) initialized
DEBUG: Worker thread (#207) initialized
DEBUG: Worker thread (#273) initialized
DEBUG: Worker thread (#370) initialized
DEBUG: Worker thread (#463) initialized
DEBUG: Worker thread (#404) initialized
DEBUG: Worker thread (#218) initialized
DEBUG: Worker thread (#469) initialized
DEBUG: Worker thread (#338) initialized
DEBUG: Worker thread (#482) initialized
DEBUG: Worker thread (#432) initialized
DEBUG: Worker thread (#356) initialized
DEBUG: Worker thread (#447) initialized
DEBUG: Worker thread (#386) initialized
DEBUG: Worker thread (#496) initialized
DEBUG: Worker thread (#401) initialized
DEBUG: Worker thread (#346) initialized
DEBUG: Worker thread (#334) initialized
DEBUG: Worker thread (#200) initialized
DEBUG: Worker thread (#304) initialized
DEBUG: Worker thread (#249) initialized
DEBUG: Worker thread (#430) initialized
DEBUG: Worker thread (#427) initialized
DEBUG: Worker thread (#408) initialized
DEBUG: Worker thread (#486) initialized
DEBUG: Worker thread (#289) initialized
DEBUG: Worker thread (#229) initialized
DEBUG: Worker thread (#262) initialized
DEBUG: Worker thread (#429) initialized
DEBUG: Worker thread (#491) initialized
DEBUG: Worker thread (#326) initialized
DEBUG: Worker thread (#448) initialized
DEBUG: Worker thread (#274) initialized
DEBUG: Worker thread (#417) initialized
DEBUG: Worker thread (#494) initialized
DEBUG: Worker thread (#363) initialized
DEBUG: Worker thread (#364) initialized
DEBUG: Worker thread (#445) initialized
DEBUG: Worker thread (#471) initialized
DEBUG: Worker thread (#399) initialized
DEBUG: Worker thread (#220) initialized
DEBUG: Worker thread (#502) initialized
DEBUG: Worker thread (#444) initialized
DEBUG: Worker thread (#488) initialized
DEBUG: Worker thread (#462) initialized
DEBUG: Worker thread (#484) initialized
DEBUG: Worker thread (#311) initialized
DEBUG: Worker thread (#413) initialized
DEBUG: Worker thread (#247) initialized
DEBUG: Worker thread (#337) initialized
DEBUG: Worker thread (#400) initialized
DEBUG: Worker thread (#487) initialized
DEBUG: Worker thread (#355) initialized
DEBUG: Worker thread (#450) initialized
DEBUG: Worker thread (#248) initialized
DEBUG: Worker thread (#275) initialized
DEBUG: Worker thread (#497) initialized
DEBUG: Worker thread (#505) initialized
DEBUG: Worker thread (#242) initialized
DEBUG: Worker thread (#155) initialized
DEBUG: Worker thread (#473) initialized
DEBUG: Worker thread (#388) initialized
DEBUG: Worker thread (#472) initialized
DEBUG: Worker thread (#378) initialized
DEBUG: Worker thread (#297) initialized
DEBUG: Worker thread (#315) initialized
DEBUG: Worker thread (#287) initialized
DEBUG: Worker thread (#349) initialized
DEBUG: Worker thread (#470) initialized
DEBUG: Worker thread (#415) initialized
DEBUG: Worker thread (#277) initialized
DEBUG: Worker thread (#239) initialized
DEBUG: Worker thread (#475) initialized
DEBUG: Worker thread (#458) initialized
DEBUG: Worker thread (#252) initialized
DEBUG: Worker thread (#357) initialized
DEBUG: Worker thread (#464) initialized
DEBUG: Worker thread (#411) initialized
DEBUG: Worker thread (#387) initialized
DEBUG: Worker thread (#455) initialized
DEBUG: Worker thread (#452) initialized
DEBUG: Worker thread (#235) initialized
DEBUG: Worker thread (#316) initialized
DEBUG: Worker thread (#503) initialized
DEBUG: Worker thread (#254) initialized
DEBUG: Worker thread (#456) initialized
DEBUG: Worker thread (#374) initialized
DEBUG: Worker thread (#457) initialized
DEBUG: Worker thread (#212) initialized
DEBUG: Worker thread (#449) initialized
DEBUG: Worker thread (#377) initialized
DEBUG: Worker thread (#296) initialized
DEBUG: Worker thread (#228) initialized
DEBUG: Worker thread (#446) initialized
DEBUG: Worker thread (#441) initialized
DEBUG: Worker thread (#317) initialized
DEBUG: Worker thread (#241) initialized
DEBUG: Worker thread (#342) initialized
DEBUG: Worker thread (#467) initialized
DEBUG: Worker thread (#325) initialized
DEBUG: Worker thread (#307) initialized
DEBUG: Worker thread (#268) initialized
DEBUG: Worker thread (#354) initialized
DEBUG: Worker thread (#351) initialized
DEBUG: Worker thread (#431) initialized
DEBUG: Worker thread (#360) initialized
DEBUG: Worker thread (#468) initialized
DEBUG: Worker thread (#319) initialized
DEBUG: Worker thread (#409) initialized
DEBUG: Worker thread (#295) initialized
DEBUG: Worker thread (#318) initialized
DEBUG: Worker thread (#481) initialized
DEBUG: Worker thread (#375) initialized
DEBUG: Worker thread (#453) initialized
DEBUG: Worker thread (#232) initialized
DEBUG: Worker thread (#384) initialized
DEBUG: Worker thread (#501) initialized
DEBUG: Worker thread (#270) initialized
DEBUG: Worker thread (#341) initialized
DEBUG: Worker thread (#160) initialized
DEBUG: Worker thread (#259) initialized
DEBUG: Worker thread (#340) initialized
DEBUG: Worker thread (#347) initialized
DEBUG: Worker thread (#358) initialized
DEBUG: Worker thread (#284) initialized
DEBUG: Worker thread (#344) initialized
DEBUG: Worker thread (#425) initialized
DEBUG: Worker thread (#479) initialized
DEBUG: Worker thread (#283) initialized
DEBUG: Worker thread (#438) initialized
DEBUG: Worker thread (#191) initialized
DEBUG: Worker thread (#353) initialized
DEBUG: Worker thread (#454) initialized
DEBUG: Worker thread (#313) initialized
DEBUG: Worker thread (#251) initialized
Threads started!

[ 10s ] thds: 512 tps: 49146.28 qps: 49146.28 (r/w/o: 49146.28/0.00/0.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 512 tps: 48906.39 qps: 48906.39 (r/w/o: 48906.39/0.00/0.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 512 tps: 48607.95 qps: 48607.95 (r/w/o: 48607.95/0.00/0.00) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 512 tps: 48800.16 qps: 48800.16 (r/w/o: 48800.16/0.00/0.00) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 512 tps: 48938.23 qps: 48938.23 (r/w/o: 48938.23/0.00/0.00) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 512 tps: 48911.82 qps: 48911.82 (r/w/o: 48911.82/0.00/0.00) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 512 tps: 48656.13 qps: 48656.13 (r/w/o: 48656.13/0.00/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 512 tps: 48365.60 qps: 48365.60 (r/w/o: 48365.60/0.00/0.00) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 512 tps: 48524.29 qps: 48524.29 (r/w/o: 48524.29/0.00/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 512 tps: 48427.83 qps: 48427.83 (r/w/o: 48427.83/0.00/0.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 512 tps: 48195.70 qps: 48195.70 (r/w/o: 48195.70/0.00/0.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 512 tps: 47905.63 qps: 47905.63 (r/w/o: 47905.63/0.00/0.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 512 tps: 48045.94 qps: 48045.94 (r/w/o: 48045.94/0.00/0.00) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 512 tps: 47938.43 qps: 47938.43 (r/w/o: 47938.43/0.00/0.00) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 512 tps: 48161.57 qps: 48161.57 (r/w/o: 48161.57/0.00/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 512 tps: 48217.68 qps: 48217.68 (r/w/o: 48217.68/0.00/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 512 tps: 48122.23 qps: 48122.23 (r/w/o: 48122.23/0.00/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 512 tps: 48144.56 qps: 48144.56 (r/w/o: 48144.56/0.00/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 512 tps: 48085.39 qps: 48085.39 (r/w/o: 48085.39/0.00/0.00) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 512 tps: 48125.86 qps: 48125.86 (r/w/o: 48125.86/0.00/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 512 tps: 48094.46 qps: 48094.46 (r/w/o: 48094.46/0.00/0.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 512 tps: 48284.55 qps: 48284.55 (r/w/o: 48284.55/0.00/0.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 512 tps: 48006.30 qps: 48006.30 (r/w/o: 48006.30/0.00/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 512 tps: 47547.99 qps: 47547.99 (r/w/o: 47547.99/0.00/0.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 512 tps: 47595.82 qps: 47595.82 (r/w/o: 47595.82/0.00/0.00) lat (ms,95%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 512 tps: 47614.78 qps: 47614.78 (r/w/o: 47614.78/0.00/0.00) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 512 tps: 47460.96 qps: 47460.96 (r/w/o: 47460.96/0.00/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 512 tps: 47603.37 qps: 47603.37 (r/w/o: 47603.37/0.00/0.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 512 tps: 47348.16 qps: 47348.16 (r/w/o: 47348.16/0.00/0.00) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
Time limit exceeded, exiting...
[ 300s ] thds: 512 tps: 51776.37 qps: 51776.37 (r/w/o: 51776.37/0.00/0.00) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
(last message repeated 511 times)
Done.

SQL statistics:
    queries performed:
        read:                            14496335
        write:                           0
        other:                           0
        total:                           14496335
    transactions:                        14496335 (48310.04 per sec.)
    queries:                             14496335 (48310.04 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0656s
    total number of events:              14496335

Latency (ms):
         min:                                  0.38
         avg:                                 10.60
         max:                                613.69
         95th percentile:                     32.53
         sum:                            153597574.16

Threads fairness:
    events (avg/stddev):           28313.1543/151.18
    execution time (avg/stddev):   299.9953/0.01